virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/flexcom.h
/* -------- FLEX_SPI_IMR : (FLEXCOM Offset: 0x41C) ( R/ 32) SPI Interrupt Mask Register -------- */
#define FLEX_SPI_IMR_RDRF_Pos                 _U_(0)                                               /**< (FLEX_SPI_IMR) Receive Data Register Full Interrupt Mask Position */
#define FLEX_SPI_IMR_RDRF_Msk                 (_U_(0x1) << FLEX_SPI_IMR_RDRF_Pos)                  /**< (FLEX_SPI_IMR) Receive Data Register Full Interrupt Mask Mask */
#define FLEX_SPI_IMR_RDRF(value)              (FLEX_SPI_IMR_RDRF_Msk & ((value) << FLEX_SPI_IMR_RDRF_Pos))
#define FLEX_SPI_IMR_TDRE_Pos                 _U_(1)                                               /**< (FLEX_SPI_IMR) SPI Transmit Data Register Empty Interrupt Mask Position */
#define FLEX_SPI_IMR_TDRE_Msk                 (_U_(0x1) << FLEX_SPI_IMR_TDRE_Pos)                  /**< (FLEX_SPI_IMR) SPI Transmit Data Register Empty Interrupt Mask Mask */
#define FLEX_SPI_IMR_TDRE(value)              (FLEX_SPI_IMR_TDRE_Msk & ((value) << FLEX_SPI_IMR_TDRE_Pos))
#define FLEX_SPI_IMR_MODF_Pos                 _U_(2)                                               /**< (FLEX_SPI_IMR) Mode Fault Error Interrupt Mask Position */
#define FLEX_SPI_IMR_MODF_Msk                 (_U_(0x1) << FLEX_SPI_IMR_MODF_Pos)                  /**< (FLEX_SPI_IMR) Mode Fault Error Interrupt Mask Mask */
#define FLEX_SPI_IMR_MODF(value)              (FLEX_SPI_IMR_MODF_Msk & ((value) << FLEX_SPI_IMR_MODF_Pos))
#define FLEX_SPI_IMR_OVRES_Pos                _U_(3)                                               /**< (FLEX_SPI_IMR) Overrun Error Interrupt Mask Position */
#define FLEX_SPI_IMR_OVRES_Msk                (_U_(0x1) << FLEX_SPI_IMR_OVRES_Pos)                 /**< (FLEX_SPI_IMR) Overrun Error Interrupt Mask Mask */
#define FLEX_SPI_IMR_OVRES(value)             (FLEX_SPI_IMR_OVRES_Msk & ((value) << FLEX_SPI_IMR_OVRES_Pos))
#define FLEX_SPI_IMR_NSSR_Pos                 _U_(8)                                               /**< (FLEX_SPI_IMR) NSS Rising Interrupt Mask Position */
#define FLEX_SPI_IMR_NSSR_Msk                 (_U_(0x1) << FLEX_SPI_IMR_NSSR_Pos)                  /**< (FLEX_SPI_IMR) NSS Rising Interrupt Mask Mask */
#define FLEX_SPI_IMR_NSSR(value)              (FLEX_SPI_IMR_NSSR_Msk & ((value) << FLEX_SPI_IMR_NSSR_Pos))
#define FLEX_SPI_IMR_TXEMPTY_Pos              _U_(9)                                               /**< (FLEX_SPI_IMR) Transmission Registers Empty Mask Position */
#define FLEX_SPI_IMR_TXEMPTY_Msk              (_U_(0x1) << FLEX_SPI_IMR_TXEMPTY_Pos)               /**< (FLEX_SPI_IMR) Transmission Registers Empty Mask Mask */
#define FLEX_SPI_IMR_TXEMPTY(value)           (FLEX_SPI_IMR_TXEMPTY_Msk & ((value) << FLEX_SPI_IMR_TXEMPTY_Pos))
#define FLEX_SPI_IMR_UNDES_Pos                _U_(10)                                              /**< (FLEX_SPI_IMR) Underrun Error Interrupt Mask Position */
#define FLEX_SPI_IMR_UNDES_Msk                (_U_(0x1) << FLEX_SPI_IMR_UNDES_Pos)                 /**< (FLEX_SPI_IMR) Underrun Error Interrupt Mask Mask */
#define FLEX_SPI_IMR_UNDES(value)             (FLEX_SPI_IMR_UNDES_Msk & ((value) << FLEX_SPI_IMR_UNDES_Pos))
#define FLEX_SPI_IMR_CMP_Pos                  _U_(11)                                              /**< (FLEX_SPI_IMR) Comparison Interrupt Mask Position */
#define FLEX_SPI_IMR_CMP_Msk                  (_U_(0x1) << FLEX_SPI_IMR_CMP_Pos)                   /**< (FLEX_SPI_IMR) Comparison Interrupt Mask Mask */
#define FLEX_SPI_IMR_CMP(value)               (FLEX_SPI_IMR_CMP_Msk & ((value) << FLEX_SPI_IMR_CMP_Pos))
#define FLEX_SPI_IMR_TXFEF_Pos                _U_(24)                                              /**< (FLEX_SPI_IMR) TXFEF Interrupt Mask Position */
#define FLEX_SPI_IMR_TXFEF_Msk                (_U_(0x1) << FLEX_SPI_IMR_TXFEF_Pos)                 /**< (FLEX_SPI_IMR) TXFEF Interrupt Mask Mask */
#define FLEX_SPI_IMR_TXFEF(value)             (FLEX_SPI_IMR_TXFEF_Msk & ((value) << FLEX_SPI_IMR_TXFEF_Pos))
#define FLEX_SPI_IMR_TXFFF_Pos                _U_(25)                                              /**< (FLEX_SPI_IMR) TXFFF Interrupt Mask Position */
#define FLEX_SPI_IMR_TXFFF_Msk                (_U_(0x1) << FLEX_SPI_IMR_TXFFF_Pos)                 /**< (FLEX_SPI_IMR) TXFFF Interrupt Mask Mask */
#define FLEX_SPI_IMR_TXFFF(value)             (FLEX_SPI_IMR_TXFFF_Msk & ((value) << FLEX_SPI_IMR_TXFFF_Pos))
#define FLEX_SPI_IMR_TXFTHF_Pos               _U_(26)                                              /**< (FLEX_SPI_IMR) TXFTHF Interrupt Mask Position */
#define FLEX_SPI_IMR_TXFTHF_Msk               (_U_(0x1) << FLEX_SPI_IMR_TXFTHF_Pos)                /**< (FLEX_SPI_IMR) TXFTHF Interrupt Mask Mask */
#define FLEX_SPI_IMR_TXFTHF(value)            (FLEX_SPI_IMR_TXFTHF_Msk & ((value) << FLEX_SPI_IMR_TXFTHF_Pos))
#define FLEX_SPI_IMR_RXFEF_Pos                _U_(27)                                              /**< (FLEX_SPI_IMR) RXFEF Interrupt Mask Position */
#define FLEX_SPI_IMR_RXFEF_Msk                (_U_(0x1) << FLEX_SPI_IMR_RXFEF_Pos)                 /**< (FLEX_SPI_IMR) RXFEF Interrupt Mask Mask */
#define FLEX_SPI_IMR_RXFEF(value)             (FLEX_SPI_IMR_RXFEF_Msk & ((value) << FLEX_SPI_IMR_RXFEF_Pos))
#define FLEX_SPI_IMR_RXFFF_Pos                _U_(28)                                              /**< (FLEX_SPI_IMR) RXFFF Interrupt Mask Position */
#define FLEX_SPI_IMR_RXFFF_Msk                (_U_(0x1) << FLEX_SPI_IMR_RXFFF_Pos)                 /**< (FLEX_SPI_IMR) RXFFF Interrupt Mask Mask */
#define FLEX_SPI_IMR_RXFFF(value)             (FLEX_SPI_IMR_RXFFF_Msk & ((value) << FLEX_SPI_IMR_RXFFF_Pos))
#define FLEX_SPI_IMR_RXFTHF_Pos               _U_(29)                                              /**< (FLEX_SPI_IMR) RXFTHF Interrupt Mask Position */
#define FLEX_SPI_IMR_RXFTHF_Msk               (_U_(0x1) << FLEX_SPI_IMR_RXFTHF_Pos)                /**< (FLEX_SPI_IMR) RXFTHF Interrupt Mask Mask */
#define FLEX_SPI_IMR_RXFTHF(value)            (FLEX_SPI_IMR_RXFTHF_Msk & ((value) << FLEX_SPI_IMR_RXFTHF_Pos))
#define FLEX_SPI_IMR_TXFPTEF_Pos              _U_(30)                                              /**< (FLEX_SPI_IMR) TXFPTEF Interrupt Mask Position */
#define FLEX_SPI_IMR_TXFPTEF_Msk              (_U_(0x1) << FLEX_SPI_IMR_TXFPTEF_Pos)               /**< (FLEX_SPI_IMR) TXFPTEF Interrupt Mask Mask */
#define FLEX_SPI_IMR_TXFPTEF(value)           (FLEX_SPI_IMR_TXFPTEF_Msk & ((value) << FLEX_SPI_IMR_TXFPTEF_Pos))
#define FLEX_SPI_IMR_RXFPTEF_Pos              _U_(31)                                              /**< (FLEX_SPI_IMR) RXFPTEF Interrupt Mask Position */
#define FLEX_SPI_IMR_RXFPTEF_Msk              (_U_(0x1) << FLEX_SPI_IMR_RXFPTEF_Pos)               /**< (FLEX_SPI_IMR) RXFPTEF Interrupt Mask Mask */
#define FLEX_SPI_IMR_RXFPTEF(value)           (FLEX_SPI_IMR_RXFPTEF_Msk & ((value) << FLEX_SPI_IMR_RXFPTEF_Pos))
#define FLEX_SPI_IMR_Msk                      _U_(0xFF000F0F)                                      /**< (FLEX_SPI_IMR) Register Mask  */


/* -------- FLEX_SPI_CSR : (FLEXCOM Offset: 0x430) (R/W 32) SPI Chip Select Register -------- */
#define FLEX_SPI_CSR_CPOL_Pos                 _U_(0)                                               /**< (FLEX_SPI_CSR) Clock Polarity Position */
#define FLEX_SPI_CSR_CPOL_Msk                 (_U_(0x1) << FLEX_SPI_CSR_CPOL_Pos)                  /**< (FLEX_SPI_CSR) Clock Polarity Mask */
#define FLEX_SPI_CSR_CPOL(value)              (FLEX_SPI_CSR_CPOL_Msk & ((value) << FLEX_SPI_CSR_CPOL_Pos))
#define FLEX_SPI_CSR_NCPHA_Pos                _U_(1)                                               /**< (FLEX_SPI_CSR) Clock Phase Position */
#define FLEX_SPI_CSR_NCPHA_Msk                (_U_(0x1) << FLEX_SPI_CSR_NCPHA_Pos)                 /**< (FLEX_SPI_CSR) Clock Phase Mask */
#define FLEX_SPI_CSR_NCPHA(value)             (FLEX_SPI_CSR_NCPHA_Msk & ((value) << FLEX_SPI_CSR_NCPHA_Pos))
#define FLEX_SPI_CSR_CSNAAT_Pos               _U_(2)                                               /**< (FLEX_SPI_CSR) Chip Select Not Active After Transfer (Ignored if CSAAT = 1) Position */
#define FLEX_SPI_CSR_CSNAAT_Msk               (_U_(0x1) << FLEX_SPI_CSR_CSNAAT_Pos)                /**< (FLEX_SPI_CSR) Chip Select Not Active After Transfer (Ignored if CSAAT = 1) Mask */
#define FLEX_SPI_CSR_CSNAAT(value)            (FLEX_SPI_CSR_CSNAAT_Msk & ((value) << FLEX_SPI_CSR_CSNAAT_Pos))
#define FLEX_SPI_CSR_CSAAT_Pos                _U_(3)                                               /**< (FLEX_SPI_CSR) Chip Select Active After Transfer Position */
#define FLEX_SPI_CSR_CSAAT_Msk                (_U_(0x1) << FLEX_SPI_CSR_CSAAT_Pos)                 /**< (FLEX_SPI_CSR) Chip Select Active After Transfer Mask */
#define FLEX_SPI_CSR_CSAAT(value)             (FLEX_SPI_CSR_CSAAT_Msk & ((value) << FLEX_SPI_CSR_CSAAT_Pos))
#define FLEX_SPI_CSR_BITS_Pos                 _U_(4)                                               /**< (FLEX_SPI_CSR) Bits Per Transfer Position */
#define FLEX_SPI_CSR_BITS_Msk                 (_U_(0xF) << FLEX_SPI_CSR_BITS_Pos)                  /**< (FLEX_SPI_CSR) Bits Per Transfer Mask */
#define FLEX_SPI_CSR_BITS(value)              (FLEX_SPI_CSR_BITS_Msk & ((value) << FLEX_SPI_CSR_BITS_Pos))
#define   FLEX_SPI_CSR_BITS_8_BIT_Val         _U_(0x0)                                             /**< (FLEX_SPI_CSR) 8 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_9_BIT_Val         _U_(0x1)                                             /**< (FLEX_SPI_CSR) 9 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_10_BIT_Val        _U_(0x2)                                             /**< (FLEX_SPI_CSR) 10 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_11_BIT_Val        _U_(0x3)                                             /**< (FLEX_SPI_CSR) 11 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_12_BIT_Val        _U_(0x4)                                             /**< (FLEX_SPI_CSR) 12 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_13_BIT_Val        _U_(0x5)                                             /**< (FLEX_SPI_CSR) 13 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_14_BIT_Val        _U_(0x6)                                             /**< (FLEX_SPI_CSR) 14 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_15_BIT_Val        _U_(0x7)                                             /**< (FLEX_SPI_CSR) 15 bits for transfer  */
#define   FLEX_SPI_CSR_BITS_16_BIT_Val        _U_(0x8)                                             /**< (FLEX_SPI_CSR) 16 bits for transfer  */
#define FLEX_SPI_CSR_BITS_8_BIT               (FLEX_SPI_CSR_BITS_8_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 8 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_9_BIT               (FLEX_SPI_CSR_BITS_9_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 9 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_10_BIT              (FLEX_SPI_CSR_BITS_10_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 10 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_11_BIT              (FLEX_SPI_CSR_BITS_11_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 11 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_12_BIT              (FLEX_SPI_CSR_BITS_12_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 12 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_13_BIT              (FLEX_SPI_CSR_BITS_13_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 13 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_14_BIT              (FLEX_SPI_CSR_BITS_14_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 14 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_15_BIT              (FLEX_SPI_CSR_BITS_15_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 15 bits for transfer Position  */
#define FLEX_SPI_CSR_BITS_16_BIT              (FLEX_SPI_CSR_BITS_16_BIT_Val << FLEX_SPI_CSR_BITS_Pos) /**< (FLEX_SPI_CSR) 16 bits for transfer Position  */
#define FLEX_SPI_CSR_SCBR_Pos                 _U_(8)                                               /**< (FLEX_SPI_CSR) Serial Clock Bit Rate Position */
#define FLEX_SPI_CSR_SCBR_Msk                 (_U_(0xFF) << FLEX_SPI_CSR_SCBR_Pos)                 /**< (FLEX_SPI_CSR) Serial Clock Bit Rate Mask */
#define FLEX_SPI_CSR_SCBR(value)              (FLEX_SPI_CSR_SCBR_Msk & ((value) << FLEX_SPI_CSR_SCBR_Pos))
#define FLEX_SPI_CSR_DLYBS_Pos                _U_(16)                                              /**< (FLEX_SPI_CSR) Delay Before SPCK Position */
#define FLEX_SPI_CSR_DLYBS_Msk                (_U_(0xFF) << FLEX_SPI_CSR_DLYBS_Pos)                /**< (FLEX_SPI_CSR) Delay Before SPCK Mask */
#define FLEX_SPI_CSR_DLYBS(value)             (FLEX_SPI_CSR_DLYBS_Msk & ((value) << FLEX_SPI_CSR_DLYBS_Pos))
#define FLEX_SPI_CSR_DLYBCT_Pos               _U_(24)                                              /**< (FLEX_SPI_CSR) Delay Between Consecutive Transfers Position */
#define FLEX_SPI_CSR_DLYBCT_Msk               (_U_(0xFF) << FLEX_SPI_CSR_DLYBCT_Pos)               /**< (FLEX_SPI_CSR) Delay Between Consecutive Transfers Mask */
#define FLEX_SPI_CSR_DLYBCT(value)            (FLEX_SPI_CSR_DLYBCT_Msk & ((value) << FLEX_SPI_CSR_DLYBCT_Pos))
#define FLEX_SPI_CSR_Msk                      _U_(0xFFFFFFFF)                                      /**< (FLEX_SPI_CSR) Register Mask  */


/* -------- FLEX_SPI_FMR : (FLEXCOM Offset: 0x440) (R/W 32) SPI FIFO Mode Register -------- */
#define FLEX_SPI_FMR_TXRDYM_Pos               _U_(0)                                               /**< (FLEX_SPI_FMR) Transmit Data Register Empty Mode Position */
#define FLEX_SPI_FMR_TXRDYM_Msk               (_U_(0x3) << FLEX_SPI_FMR_TXRDYM_Pos)                /**< (FLEX_SPI_FMR) Transmit Data Register Empty Mode Mask */
#define FLEX_SPI_FMR_TXRDYM(value)            (FLEX_SPI_FMR_TXRDYM_Msk & ((value) << FLEX_SPI_FMR_TXRDYM_Pos))
#define   FLEX_SPI_FMR_TXRDYM_ONE_DATA_Val    _U_(0x0)                                             /**< (FLEX_SPI_FMR) TDRE will be at level '1' when at least one data can be written in the Transmit FIFO.  */
#define   FLEX_SPI_FMR_TXRDYM_TWO_DATA_Val    _U_(0x1)                                             /**< (FLEX_SPI_FMR) TDRE will be at level '1' when at least two data can be written in the Transmit FIFO.Cannot be used if FLEX_SPI_MR.PS =1.  */
#define FLEX_SPI_FMR_TXRDYM_ONE_DATA          (FLEX_SPI_FMR_TXRDYM_ONE_DATA_Val << FLEX_SPI_FMR_TXRDYM_Pos) /**< (FLEX_SPI_FMR) TDRE will be at level '1' when at least one data can be written in the Transmit FIFO. Position  */
#define FLEX_SPI_FMR_TXRDYM_TWO_DATA          (FLEX_SPI_FMR_TXRDYM_TWO_DATA_Val << FLEX_SPI_FMR_TXRDYM_Pos) /**< (FLEX_SPI_FMR) TDRE will be at level '1' when at least two data can be written in the Transmit FIFO.Cannot be used if FLEX_SPI_MR.PS =1. Position  */
#define FLEX_SPI_FMR_RXRDYM_Pos               _U_(4)                                               /**< (FLEX_SPI_FMR) Receive Data Register Full Mode Position */
#define FLEX_SPI_FMR_RXRDYM_Msk               (_U_(0x3) << FLEX_SPI_FMR_RXRDYM_Pos)                /**< (FLEX_SPI_FMR) Receive Data Register Full Mode Mask */
#define FLEX_SPI_FMR_RXRDYM(value)            (FLEX_SPI_FMR_RXRDYM_Msk & ((value) << FLEX_SPI_FMR_RXRDYM_Pos))
#define   FLEX_SPI_FMR_RXRDYM_ONE_DATA_Val    _U_(0x0)                                             /**< (FLEX_SPI_FMR) RDRF will be at level '1' when at least one unread data is in the Receive FIFO.  */
#define   FLEX_SPI_FMR_RXRDYM_TWO_DATA_Val    _U_(0x1)                                             /**< (FLEX_SPI_FMR) RDRF will be at level '1' when at least two unread data are in the Receive FIFO.Cannot be used if FLEX_SPI_MR.PS =1.  */
#define   FLEX_SPI_FMR_RXRDYM_FOUR_DATA_Val   _U_(0x2)                                             /**< (FLEX_SPI_FMR) RDRF will be at level '1' when at least four unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1.  */
#define FLEX_SPI_FMR_RXRDYM_ONE_DATA          (FLEX_SPI_FMR_RXRDYM_ONE_DATA_Val << FLEX_SPI_FMR_RXRDYM_Pos) /**< (FLEX_SPI_FMR) RDRF will be at level '1' when at least one unread data is in the Receive FIFO. Position  */
#define FLEX_SPI_FMR_RXRDYM_TWO_DATA          (FLEX_SPI_FMR_RXRDYM_TWO_DATA_Val << FLEX_SPI_FMR_RXRDYM_Pos) /**< (FLEX_SPI_FMR) RDRF will be at level '1' when at least two unread data are in the Receive FIFO.Cannot be used if FLEX_SPI_MR.PS =1. Position  */
#define FLEX_SPI_FMR_RXRDYM_FOUR_DATA         (FLEX_SPI_FMR_RXRDYM_FOUR_DATA_Val << FLEX_SPI_FMR_RXRDYM_Pos) /**< (FLEX_SPI_FMR) RDRF will be at level '1' when at least four unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1. Position  */
#define FLEX_SPI_FMR_TXFTHRES_Pos             _U_(16)                                              /**< (FLEX_SPI_FMR) Transmit FIFO Threshold Position */
#define FLEX_SPI_FMR_TXFTHRES_Msk             (_U_(0x3F) << FLEX_SPI_FMR_TXFTHRES_Pos)             /**< (FLEX_SPI_FMR) Transmit FIFO Threshold Mask */
#define FLEX_SPI_FMR_TXFTHRES(value)          (FLEX_SPI_FMR_TXFTHRES_Msk & ((value) << FLEX_SPI_FMR_TXFTHRES_Pos))
#define FLEX_SPI_FMR_RXFTHRES_Pos             _U_(24)                                              /**< (FLEX_SPI_FMR) Receive FIFO Threshold Position */
#define FLEX_SPI_FMR_RXFTHRES_Msk             (_U_(0x3F) << FLEX_SPI_FMR_RXFTHRES_Pos)             /**< (FLEX_SPI_FMR) Receive FIFO Threshold Mask */
#define FLEX_SPI_FMR_RXFTHRES(value)          (FLEX_SPI_FMR_RXFTHRES_Msk & ((value) << FLEX_SPI_FMR_RXFTHRES_Pos))
#define FLEX_SPI_FMR_Msk                      _U_(0x3F3F0033)                                      /**< (FLEX_SPI_FMR) Register Mask  */


/* -------- FLEX_SPI_FLR : (FLEXCOM Offset: 0x444) ( R/ 32) SPI FIFO Level Register -------- */
#define FLEX_SPI_FLR_TXFL_Pos                 _U_(0)                                               /**< (FLEX_SPI_FLR) Transmit FIFO Level Position */
#define FLEX_SPI_FLR_TXFL_Msk                 (_U_(0x3F) << FLEX_SPI_FLR_TXFL_Pos)                 /**< (FLEX_SPI_FLR) Transmit FIFO Level Mask */
#define FLEX_SPI_FLR_TXFL(value)              (FLEX_SPI_FLR_TXFL_Msk & ((value) << FLEX_SPI_FLR_TXFL_Pos))
#define FLEX_SPI_FLR_RXFL_Pos                 _U_(16)                                              /**< (FLEX_SPI_FLR) Receive FIFO Level Position */
#define FLEX_SPI_FLR_RXFL_Msk                 (_U_(0x3F) << FLEX_SPI_FLR_RXFL_Pos)                 /**< (FLEX_SPI_FLR) Receive FIFO Level Mask */
#define FLEX_SPI_FLR_RXFL(value)              (FLEX_SPI_FLR_RXFL_Msk & ((value) << FLEX_SPI_FLR_RXFL_Pos))
#define FLEX_SPI_FLR_Msk                      _U_(0x003F003F)                                      /**< (FLEX_SPI_FLR) Register Mask  */


/* -------- FLEX_SPI_CMPR : (FLEXCOM Offset: 0x448) (R/W 32) SPI Comparison Register -------- */
#define FLEX_SPI_CMPR_VAL1_Pos                _U_(0)                                               /**< (FLEX_SPI_CMPR) First Comparison Value for Received Character Position */
#define FLEX_SPI_CMPR_VAL1_Msk                (_U_(0xFFFF) << FLEX_SPI_CMPR_VAL1_Pos)              /**< (FLEX_SPI_CMPR) First Comparison Value for Received Character Mask */
#define FLEX_SPI_CMPR_VAL1(value)             (FLEX_SPI_CMPR_VAL1_Msk & ((value) << FLEX_SPI_CMPR_VAL1_Pos))
#define FLEX_SPI_CMPR_VAL2_Pos                _U_(16)                                              /**< (FLEX_SPI_CMPR) Second Comparison Value for Received Character Position */
#define FLEX_SPI_CMPR_VAL2_Msk                (_U_(0xFFFF) << FLEX_SPI_CMPR_VAL2_Pos)              /**< (FLEX_SPI_CMPR) Second Comparison Value for Received Character Mask */
#define FLEX_SPI_CMPR_VAL2(value)             (FLEX_SPI_CMPR_VAL2_Msk & ((value) << FLEX_SPI_CMPR_VAL2_Pos))
#define FLEX_SPI_CMPR_Msk                     _U_(0xFFFFFFFF)                                      /**< (FLEX_SPI_CMPR) Register Mask  */


/* -------- FLEX_SPI_WPMR : (FLEXCOM Offset: 0x4E4) (R/W 32) SPI Write Protection Mode Register -------- */
#define FLEX_SPI_WPMR_WPEN_Pos                _U_(0)                                               /**< (FLEX_SPI_WPMR) Write Protection Enable Position */
#define FLEX_SPI_WPMR_WPEN_Msk                (_U_(0x1) << FLEX_SPI_WPMR_WPEN_Pos)                 /**< (FLEX_SPI_WPMR) Write Protection Enable Mask */
#define FLEX_SPI_WPMR_WPEN(value)             (FLEX_SPI_WPMR_WPEN_Msk & ((value) << FLEX_SPI_WPMR_WPEN_Pos))
#define FLEX_SPI_WPMR_WPKEY_Pos               _U_(8)                                               /**< (FLEX_SPI_WPMR) Write Protection Key Position */
#define FLEX_SPI_WPMR_WPKEY_Msk               (_U_(0xFFFFFF) << FLEX_SPI_WPMR_WPKEY_Pos)           /**< (FLEX_SPI_WPMR) Write Protection Key Mask */
#define FLEX_SPI_WPMR_WPKEY(value)            (FLEX_SPI_WPMR_WPKEY_Msk & ((value) << FLEX_SPI_WPMR_WPKEY_Pos))
#define   FLEX_SPI_WPMR_WPKEY_PASSWD_Val      _U_(0x535049)                                        /**< (FLEX_SPI_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0  */
#define FLEX_SPI_WPMR_WPKEY_PASSWD            (FLEX_SPI_WPMR_WPKEY_PASSWD_Val << FLEX_SPI_WPMR_WPKEY_Pos) /**< (FLEX_SPI_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0 Position  */
#define FLEX_SPI_WPMR_Msk                     _U_(0xFFFFFF01)                                      /**< (FLEX_SPI_WPMR) Register Mask  */


