virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/flexcom.h
/* FIFO_ENABLED mode */
#define FLEX_TWI_SR_FIFO_ENABLED_TXCOMP_Pos   _U_(0)                                               /**< (FLEX_TWI_SR) Transmission Completed (cleared by writing FLEX_TWI_THR) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_TXCOMP_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_TXCOMP_Pos)    /**< (FLEX_TWI_SR) Transmission Completed (cleared by writing FLEX_TWI_THR) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_TXCOMP(value) (FLEX_TWI_SR_FIFO_ENABLED_TXCOMP_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_TXCOMP_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_RXRDY_Pos    _U_(1)                                               /**< (FLEX_TWI_SR) Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_RXRDY_Msk    (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_RXRDY_Pos)     /**< (FLEX_TWI_SR) Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_RXRDY(value) (FLEX_TWI_SR_FIFO_ENABLED_RXRDY_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_RXRDY_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_TXRDY_Pos    _U_(2)                                               /**< (FLEX_TWI_SR) Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_TXRDY_Msk    (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_TXRDY_Pos)     /**< (FLEX_TWI_SR) Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_TXRDY(value) (FLEX_TWI_SR_FIFO_ENABLED_TXRDY_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_TXRDY_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SVREAD_Pos   _U_(3)                                               /**< (FLEX_TWI_SR) Slave Read Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SVREAD_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SVREAD_Pos)    /**< (FLEX_TWI_SR) Slave Read Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SVREAD(value) (FLEX_TWI_SR_FIFO_ENABLED_SVREAD_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SVREAD_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SVACC_Pos    _U_(4)                                               /**< (FLEX_TWI_SR) Slave Access Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SVACC_Msk    (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SVACC_Pos)     /**< (FLEX_TWI_SR) Slave Access Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SVACC(value) (FLEX_TWI_SR_FIFO_ENABLED_SVACC_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SVACC_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_GACC_Pos     _U_(5)                                               /**< (FLEX_TWI_SR) General Call Access (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_GACC_Msk     (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_GACC_Pos)      /**< (FLEX_TWI_SR) General Call Access (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_GACC(value)  (FLEX_TWI_SR_FIFO_ENABLED_GACC_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_GACC_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_OVRE_Pos     _U_(6)                                               /**< (FLEX_TWI_SR) Overrun Error (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_OVRE_Msk     (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_OVRE_Pos)      /**< (FLEX_TWI_SR) Overrun Error (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_OVRE(value)  (FLEX_TWI_SR_FIFO_ENABLED_OVRE_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_OVRE_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_UNRE_Pos     _U_(7)                                               /**< (FLEX_TWI_SR) Underrun Error (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_UNRE_Msk     (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_UNRE_Pos)      /**< (FLEX_TWI_SR) Underrun Error (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_UNRE(value)  (FLEX_TWI_SR_FIFO_ENABLED_UNRE_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_UNRE_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_NACK_Pos     _U_(8)                                               /**< (FLEX_TWI_SR) Not Acknowledged (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_NACK_Msk     (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_NACK_Pos)      /**< (FLEX_TWI_SR) Not Acknowledged (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_NACK(value)  (FLEX_TWI_SR_FIFO_ENABLED_NACK_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_NACK_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_ARBLST_Pos   _U_(9)                                               /**< (FLEX_TWI_SR) Arbitration Lost (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_ARBLST_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_ARBLST_Pos)    /**< (FLEX_TWI_SR) Arbitration Lost (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_ARBLST(value) (FLEX_TWI_SR_FIFO_ENABLED_ARBLST_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_ARBLST_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SCLWS_Pos    _U_(10)                                              /**< (FLEX_TWI_SR) Clock Wait State Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SCLWS_Msk    (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SCLWS_Pos)     /**< (FLEX_TWI_SR) Clock Wait State Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SCLWS(value) (FLEX_TWI_SR_FIFO_ENABLED_SCLWS_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SCLWS_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_EOSACC_Pos   _U_(11)                                              /**< (FLEX_TWI_SR) End Of Slave Access (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_EOSACC_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_EOSACC_Pos)    /**< (FLEX_TWI_SR) End Of Slave Access (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_EOSACC(value) (FLEX_TWI_SR_FIFO_ENABLED_EOSACC_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_EOSACC_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_MCACK_Pos    _U_(16)                                              /**< (FLEX_TWI_SR) Master Code Acknowledge (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_MCACK_Msk    (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_MCACK_Pos)     /**< (FLEX_TWI_SR) Master Code Acknowledge (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_MCACK(value) (FLEX_TWI_SR_FIFO_ENABLED_MCACK_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_MCACK_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_TOUT_Pos     _U_(18)                                              /**< (FLEX_TWI_SR) Timeout Error (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_TOUT_Msk     (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_TOUT_Pos)      /**< (FLEX_TWI_SR) Timeout Error (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_TOUT(value)  (FLEX_TWI_SR_FIFO_ENABLED_TOUT_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_TOUT_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_PECERR_Pos   _U_(19)                                              /**< (FLEX_TWI_SR) PEC Error (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_PECERR_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_PECERR_Pos)    /**< (FLEX_TWI_SR) PEC Error (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_PECERR(value) (FLEX_TWI_SR_FIFO_ENABLED_PECERR_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_PECERR_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SMBDAM_Pos   _U_(20)                                              /**< (FLEX_TWI_SR) SMBus Default Address Match (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SMBDAM_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SMBDAM_Pos)    /**< (FLEX_TWI_SR) SMBus Default Address Match (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SMBDAM(value) (FLEX_TWI_SR_FIFO_ENABLED_SMBDAM_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SMBDAM_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SMBHHM_Pos   _U_(21)                                              /**< (FLEX_TWI_SR) SMBus Host Header Address Match (cleared on read) Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SMBHHM_Msk   (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SMBHHM_Pos)    /**< (FLEX_TWI_SR) SMBus Host Header Address Match (cleared on read) Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SMBHHM(value) (FLEX_TWI_SR_FIFO_ENABLED_SMBHHM_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SMBHHM_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_TXFLOCK_Pos  _U_(23)                                              /**< (FLEX_TWI_SR) Transmit FIFO Lock Position */
#define FLEX_TWI_SR_FIFO_ENABLED_TXFLOCK_Msk  (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_TXFLOCK_Pos)   /**< (FLEX_TWI_SR) Transmit FIFO Lock Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_TXFLOCK(value) (FLEX_TWI_SR_FIFO_ENABLED_TXFLOCK_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_TXFLOCK_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SCL_Pos      _U_(24)                                              /**< (FLEX_TWI_SR) SCL Line Value Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SCL_Msk      (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SCL_Pos)       /**< (FLEX_TWI_SR) SCL Line Value Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SCL(value)   (FLEX_TWI_SR_FIFO_ENABLED_SCL_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SCL_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_SDA_Pos      _U_(25)                                              /**< (FLEX_TWI_SR) SDA Line Value Position */
#define FLEX_TWI_SR_FIFO_ENABLED_SDA_Msk      (_U_(0x1) << FLEX_TWI_SR_FIFO_ENABLED_SDA_Pos)       /**< (FLEX_TWI_SR) SDA Line Value Mask */
#define FLEX_TWI_SR_FIFO_ENABLED_SDA(value)   (FLEX_TWI_SR_FIFO_ENABLED_SDA_Msk & ((value) << FLEX_TWI_SR_FIFO_ENABLED_SDA_Pos))
#define FLEX_TWI_SR_FIFO_ENABLED_Msk          _U_(0x03BD0FFF)                                       /**< (FLEX_TWI_SR_FIFO_ENABLED) Register Mask  */


/* -------- FLEX_TWI_IER : (FLEXCOM Offset: 0x624) ( /W 32) TWI Interrupt Enable Register -------- */
#define FLEX_TWI_IER_TXCOMP_Pos               _U_(0)                                               /**< (FLEX_TWI_IER) Transmission Completed Interrupt Enable Position */
#define FLEX_TWI_IER_TXCOMP_Msk               (_U_(0x1) << FLEX_TWI_IER_TXCOMP_Pos)                /**< (FLEX_TWI_IER) Transmission Completed Interrupt Enable Mask */
#define FLEX_TWI_IER_TXCOMP(value)            (FLEX_TWI_IER_TXCOMP_Msk & ((value) << FLEX_TWI_IER_TXCOMP_Pos))
#define FLEX_TWI_IER_RXRDY_Pos                _U_(1)                                               /**< (FLEX_TWI_IER) Receive Holding Register Ready Interrupt Enable Position */
#define FLEX_TWI_IER_RXRDY_Msk                (_U_(0x1) << FLEX_TWI_IER_RXRDY_Pos)                 /**< (FLEX_TWI_IER) Receive Holding Register Ready Interrupt Enable Mask */
#define FLEX_TWI_IER_RXRDY(value)             (FLEX_TWI_IER_RXRDY_Msk & ((value) << FLEX_TWI_IER_RXRDY_Pos))
#define FLEX_TWI_IER_TXRDY_Pos                _U_(2)                                               /**< (FLEX_TWI_IER) Transmit Holding Register Ready Interrupt Enable Position */
#define FLEX_TWI_IER_TXRDY_Msk                (_U_(0x1) << FLEX_TWI_IER_TXRDY_Pos)                 /**< (FLEX_TWI_IER) Transmit Holding Register Ready Interrupt Enable Mask */
#define FLEX_TWI_IER_TXRDY(value)             (FLEX_TWI_IER_TXRDY_Msk & ((value) << FLEX_TWI_IER_TXRDY_Pos))
#define FLEX_TWI_IER_SVACC_Pos                _U_(4)                                               /**< (FLEX_TWI_IER) Slave Access Interrupt Enable Position */
#define FLEX_TWI_IER_SVACC_Msk                (_U_(0x1) << FLEX_TWI_IER_SVACC_Pos)                 /**< (FLEX_TWI_IER) Slave Access Interrupt Enable Mask */
#define FLEX_TWI_IER_SVACC(value)             (FLEX_TWI_IER_SVACC_Msk & ((value) << FLEX_TWI_IER_SVACC_Pos))
#define FLEX_TWI_IER_GACC_Pos                 _U_(5)                                               /**< (FLEX_TWI_IER) General Call Access Interrupt Enable Position */
#define FLEX_TWI_IER_GACC_Msk                 (_U_(0x1) << FLEX_TWI_IER_GACC_Pos)                  /**< (FLEX_TWI_IER) General Call Access Interrupt Enable Mask */
#define FLEX_TWI_IER_GACC(value)              (FLEX_TWI_IER_GACC_Msk & ((value) << FLEX_TWI_IER_GACC_Pos))
#define FLEX_TWI_IER_OVRE_Pos                 _U_(6)                                               /**< (FLEX_TWI_IER) Overrun Error Interrupt Enable Position */
#define FLEX_TWI_IER_OVRE_Msk                 (_U_(0x1) << FLEX_TWI_IER_OVRE_Pos)                  /**< (FLEX_TWI_IER) Overrun Error Interrupt Enable Mask */
#define FLEX_TWI_IER_OVRE(value)              (FLEX_TWI_IER_OVRE_Msk & ((value) << FLEX_TWI_IER_OVRE_Pos))
#define FLEX_TWI_IER_UNRE_Pos                 _U_(7)                                               /**< (FLEX_TWI_IER) Underrun Error Interrupt Enable Position */
#define FLEX_TWI_IER_UNRE_Msk                 (_U_(0x1) << FLEX_TWI_IER_UNRE_Pos)                  /**< (FLEX_TWI_IER) Underrun Error Interrupt Enable Mask */
#define FLEX_TWI_IER_UNRE(value)              (FLEX_TWI_IER_UNRE_Msk & ((value) << FLEX_TWI_IER_UNRE_Pos))
#define FLEX_TWI_IER_NACK_Pos                 _U_(8)                                               /**< (FLEX_TWI_IER) Not Acknowledge Interrupt Enable Position */
#define FLEX_TWI_IER_NACK_Msk                 (_U_(0x1) << FLEX_TWI_IER_NACK_Pos)                  /**< (FLEX_TWI_IER) Not Acknowledge Interrupt Enable Mask */
#define FLEX_TWI_IER_NACK(value)              (FLEX_TWI_IER_NACK_Msk & ((value) << FLEX_TWI_IER_NACK_Pos))
#define FLEX_TWI_IER_ARBLST_Pos               _U_(9)                                               /**< (FLEX_TWI_IER) Arbitration Lost Interrupt Enable Position */
#define FLEX_TWI_IER_ARBLST_Msk               (_U_(0x1) << FLEX_TWI_IER_ARBLST_Pos)                /**< (FLEX_TWI_IER) Arbitration Lost Interrupt Enable Mask */
#define FLEX_TWI_IER_ARBLST(value)            (FLEX_TWI_IER_ARBLST_Msk & ((value) << FLEX_TWI_IER_ARBLST_Pos))
#define FLEX_TWI_IER_SCL_WS_Pos               _U_(10)                                              /**< (FLEX_TWI_IER) Clock Wait State Interrupt Enable Position */
#define FLEX_TWI_IER_SCL_WS_Msk               (_U_(0x1) << FLEX_TWI_IER_SCL_WS_Pos)                /**< (FLEX_TWI_IER) Clock Wait State Interrupt Enable Mask */
#define FLEX_TWI_IER_SCL_WS(value)            (FLEX_TWI_IER_SCL_WS_Msk & ((value) << FLEX_TWI_IER_SCL_WS_Pos))
#define FLEX_TWI_IER_EOSACC_Pos               _U_(11)                                              /**< (FLEX_TWI_IER) End Of Slave Access Interrupt Enable Position */
#define FLEX_TWI_IER_EOSACC_Msk               (_U_(0x1) << FLEX_TWI_IER_EOSACC_Pos)                /**< (FLEX_TWI_IER) End Of Slave Access Interrupt Enable Mask */
#define FLEX_TWI_IER_EOSACC(value)            (FLEX_TWI_IER_EOSACC_Msk & ((value) << FLEX_TWI_IER_EOSACC_Pos))
#define FLEX_TWI_IER_ENDRX_Pos                _U_(12)                                              /**< (FLEX_TWI_IER) End of Receive Buffer Interrupt Enable Position */
#define FLEX_TWI_IER_ENDRX_Msk                (_U_(0x1) << FLEX_TWI_IER_ENDRX_Pos)                 /**< (FLEX_TWI_IER) End of Receive Buffer Interrupt Enable Mask */
#define FLEX_TWI_IER_ENDRX(value)             (FLEX_TWI_IER_ENDRX_Msk & ((value) << FLEX_TWI_IER_ENDRX_Pos))
#define FLEX_TWI_IER_ENDTX_Pos                _U_(13)                                              /**< (FLEX_TWI_IER) End of Transmit Buffer Interrupt Enable Position */
#define FLEX_TWI_IER_ENDTX_Msk                (_U_(0x1) << FLEX_TWI_IER_ENDTX_Pos)                 /**< (FLEX_TWI_IER) End of Transmit Buffer Interrupt Enable Mask */
#define FLEX_TWI_IER_ENDTX(value)             (FLEX_TWI_IER_ENDTX_Msk & ((value) << FLEX_TWI_IER_ENDTX_Pos))
#define FLEX_TWI_IER_RXBUFF_Pos               _U_(14)                                              /**< (FLEX_TWI_IER) Receive Buffer Full Interrupt Enable Position */
#define FLEX_TWI_IER_RXBUFF_Msk               (_U_(0x1) << FLEX_TWI_IER_RXBUFF_Pos)                /**< (FLEX_TWI_IER) Receive Buffer Full Interrupt Enable Mask */
#define FLEX_TWI_IER_RXBUFF(value)            (FLEX_TWI_IER_RXBUFF_Msk & ((value) << FLEX_TWI_IER_RXBUFF_Pos))
#define FLEX_TWI_IER_TXBUFE_Pos               _U_(15)                                              /**< (FLEX_TWI_IER) Transmit Buffer Empty Interrupt Enable Position */
#define FLEX_TWI_IER_TXBUFE_Msk               (_U_(0x1) << FLEX_TWI_IER_TXBUFE_Pos)                /**< (FLEX_TWI_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define FLEX_TWI_IER_TXBUFE(value)            (FLEX_TWI_IER_TXBUFE_Msk & ((value) << FLEX_TWI_IER_TXBUFE_Pos))
#define FLEX_TWI_IER_MCACK_Pos                _U_(16)                                              /**< (FLEX_TWI_IER) Master Code Acknowledge Interrupt Enable Position */
#define FLEX_TWI_IER_MCACK_Msk                (_U_(0x1) << FLEX_TWI_IER_MCACK_Pos)                 /**< (FLEX_TWI_IER) Master Code Acknowledge Interrupt Enable Mask */
#define FLEX_TWI_IER_MCACK(value)             (FLEX_TWI_IER_MCACK_Msk & ((value) << FLEX_TWI_IER_MCACK_Pos))
#define FLEX_TWI_IER_TOUT_Pos                 _U_(18)                                              /**< (FLEX_TWI_IER) Timeout Error Interrupt Enable Position */
#define FLEX_TWI_IER_TOUT_Msk                 (_U_(0x1) << FLEX_TWI_IER_TOUT_Pos)                  /**< (FLEX_TWI_IER) Timeout Error Interrupt Enable Mask */
#define FLEX_TWI_IER_TOUT(value)              (FLEX_TWI_IER_TOUT_Msk & ((value) << FLEX_TWI_IER_TOUT_Pos))
#define FLEX_TWI_IER_PECERR_Pos               _U_(19)                                              /**< (FLEX_TWI_IER) PEC Error Interrupt Enable Position */
#define FLEX_TWI_IER_PECERR_Msk               (_U_(0x1) << FLEX_TWI_IER_PECERR_Pos)                /**< (FLEX_TWI_IER) PEC Error Interrupt Enable Mask */
#define FLEX_TWI_IER_PECERR(value)            (FLEX_TWI_IER_PECERR_Msk & ((value) << FLEX_TWI_IER_PECERR_Pos))
#define FLEX_TWI_IER_SMBDAM_Pos               _U_(20)                                              /**< (FLEX_TWI_IER) SMBus Default Address Match Interrupt Enable Position */
#define FLEX_TWI_IER_SMBDAM_Msk               (_U_(0x1) << FLEX_TWI_IER_SMBDAM_Pos)                /**< (FLEX_TWI_IER) SMBus Default Address Match Interrupt Enable Mask */
#define FLEX_TWI_IER_SMBDAM(value)            (FLEX_TWI_IER_SMBDAM_Msk & ((value) << FLEX_TWI_IER_SMBDAM_Pos))
#define FLEX_TWI_IER_SMBHHM_Pos               _U_(21)                                              /**< (FLEX_TWI_IER) SMBus Host Header Address Match Interrupt Enable Position */
#define FLEX_TWI_IER_SMBHHM_Msk               (_U_(0x1) << FLEX_TWI_IER_SMBHHM_Pos)                /**< (FLEX_TWI_IER) SMBus Host Header Address Match Interrupt Enable Mask */
#define FLEX_TWI_IER_SMBHHM(value)            (FLEX_TWI_IER_SMBHHM_Msk & ((value) << FLEX_TWI_IER_SMBHHM_Pos))
#define FLEX_TWI_IER_Msk                      _U_(0x003DFFF7)                                      /**< (FLEX_TWI_IER) Register Mask  */


