virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/flexcom.h
/* -------- FLEX_TWI_FMR : (FLEXCOM Offset: 0x650) (R/W 32) TWI FIFO Mode Register -------- */
#define FLEX_TWI_FMR_TXRDYM_Pos               _U_(0)                                               /**< (FLEX_TWI_FMR) Transmitter Ready Mode Position */
#define FLEX_TWI_FMR_TXRDYM_Msk               (_U_(0x3) << FLEX_TWI_FMR_TXRDYM_Pos)                /**< (FLEX_TWI_FMR) Transmitter Ready Mode Mask */
#define FLEX_TWI_FMR_TXRDYM(value)            (FLEX_TWI_FMR_TXRDYM_Msk & ((value) << FLEX_TWI_FMR_TXRDYM_Pos))
#define   FLEX_TWI_FMR_TXRDYM_ONE_DATA_Val    _U_(0x0)                                             /**< (FLEX_TWI_FMR) TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO  */
#define   FLEX_TWI_FMR_TXRDYM_TWO_DATA_Val    _U_(0x1)                                             /**< (FLEX_TWI_FMR) TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO  */
#define   FLEX_TWI_FMR_TXRDYM_FOUR_DATA_Val   _U_(0x2)                                             /**< (FLEX_TWI_FMR) TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO  */
#define FLEX_TWI_FMR_TXRDYM_ONE_DATA          (FLEX_TWI_FMR_TXRDYM_ONE_DATA_Val << FLEX_TWI_FMR_TXRDYM_Pos) /**< (FLEX_TWI_FMR) TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO Position  */
#define FLEX_TWI_FMR_TXRDYM_TWO_DATA          (FLEX_TWI_FMR_TXRDYM_TWO_DATA_Val << FLEX_TWI_FMR_TXRDYM_Pos) /**< (FLEX_TWI_FMR) TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO Position  */
#define FLEX_TWI_FMR_TXRDYM_FOUR_DATA         (FLEX_TWI_FMR_TXRDYM_FOUR_DATA_Val << FLEX_TWI_FMR_TXRDYM_Pos) /**< (FLEX_TWI_FMR) TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO Position  */
#define FLEX_TWI_FMR_RXRDYM_Pos               _U_(4)                                               /**< (FLEX_TWI_FMR) Receiver Ready Mode Position */
#define FLEX_TWI_FMR_RXRDYM_Msk               (_U_(0x3) << FLEX_TWI_FMR_RXRDYM_Pos)                /**< (FLEX_TWI_FMR) Receiver Ready Mode Mask */
#define FLEX_TWI_FMR_RXRDYM(value)            (FLEX_TWI_FMR_RXRDYM_Msk & ((value) << FLEX_TWI_FMR_RXRDYM_Pos))
#define   FLEX_TWI_FMR_RXRDYM_ONE_DATA_Val    _U_(0x0)                                             /**< (FLEX_TWI_FMR) RXRDY will be at level '1' when at least one unread data is in the Receive FIFO  */
#define   FLEX_TWI_FMR_RXRDYM_TWO_DATA_Val    _U_(0x1)                                             /**< (FLEX_TWI_FMR) RXRDY will be at level '1' when at least two unread data are in the Receive FIFO  */
#define   FLEX_TWI_FMR_RXRDYM_FOUR_DATA_Val   _U_(0x2)                                             /**< (FLEX_TWI_FMR) RXRDY will be at level '1' when at least four unread data are in the Receive FIFO  */
#define FLEX_TWI_FMR_RXRDYM_ONE_DATA          (FLEX_TWI_FMR_RXRDYM_ONE_DATA_Val << FLEX_TWI_FMR_RXRDYM_Pos) /**< (FLEX_TWI_FMR) RXRDY will be at level '1' when at least one unread data is in the Receive FIFO Position  */
#define FLEX_TWI_FMR_RXRDYM_TWO_DATA          (FLEX_TWI_FMR_RXRDYM_TWO_DATA_Val << FLEX_TWI_FMR_RXRDYM_Pos) /**< (FLEX_TWI_FMR) RXRDY will be at level '1' when at least two unread data are in the Receive FIFO Position  */
#define FLEX_TWI_FMR_RXRDYM_FOUR_DATA         (FLEX_TWI_FMR_RXRDYM_FOUR_DATA_Val << FLEX_TWI_FMR_RXRDYM_Pos) /**< (FLEX_TWI_FMR) RXRDY will be at level '1' when at least four unread data are in the Receive FIFO Position  */
#define FLEX_TWI_FMR_TXFTHRES_Pos             _U_(16)                                              /**< (FLEX_TWI_FMR) Transmit FIFO Threshold Position */
#define FLEX_TWI_FMR_TXFTHRES_Msk             (_U_(0x3F) << FLEX_TWI_FMR_TXFTHRES_Pos)             /**< (FLEX_TWI_FMR) Transmit FIFO Threshold Mask */
#define FLEX_TWI_FMR_TXFTHRES(value)          (FLEX_TWI_FMR_TXFTHRES_Msk & ((value) << FLEX_TWI_FMR_TXFTHRES_Pos))
#define FLEX_TWI_FMR_RXFTHRES_Pos             _U_(24)                                              /**< (FLEX_TWI_FMR) Receive FIFO Threshold Position */
#define FLEX_TWI_FMR_RXFTHRES_Msk             (_U_(0x3F) << FLEX_TWI_FMR_RXFTHRES_Pos)             /**< (FLEX_TWI_FMR) Receive FIFO Threshold Mask */
#define FLEX_TWI_FMR_RXFTHRES(value)          (FLEX_TWI_FMR_RXFTHRES_Msk & ((value) << FLEX_TWI_FMR_RXFTHRES_Pos))
#define FLEX_TWI_FMR_Msk                      _U_(0x3F3F0033)                                      /**< (FLEX_TWI_FMR) Register Mask  */


/* -------- FLEX_TWI_FLR : (FLEXCOM Offset: 0x654) ( R/ 32) TWI FIFO Level Register -------- */
#define FLEX_TWI_FLR_TXFL_Pos                 _U_(0)                                               /**< (FLEX_TWI_FLR) Transmit FIFO Level Position */
#define FLEX_TWI_FLR_TXFL_Msk                 (_U_(0x3F) << FLEX_TWI_FLR_TXFL_Pos)                 /**< (FLEX_TWI_FLR) Transmit FIFO Level Mask */
#define FLEX_TWI_FLR_TXFL(value)              (FLEX_TWI_FLR_TXFL_Msk & ((value) << FLEX_TWI_FLR_TXFL_Pos))
#define FLEX_TWI_FLR_RXFL_Pos                 _U_(16)                                              /**< (FLEX_TWI_FLR) Receive FIFO Level Position */
#define FLEX_TWI_FLR_RXFL_Msk                 (_U_(0x3F) << FLEX_TWI_FLR_RXFL_Pos)                 /**< (FLEX_TWI_FLR) Receive FIFO Level Mask */
#define FLEX_TWI_FLR_RXFL(value)              (FLEX_TWI_FLR_RXFL_Msk & ((value) << FLEX_TWI_FLR_RXFL_Pos))
#define FLEX_TWI_FLR_Msk                      _U_(0x003F003F)                                      /**< (FLEX_TWI_FLR) Register Mask  */


/* -------- FLEX_TWI_FSR : (FLEXCOM Offset: 0x660) ( R/ 32) TWI FIFO Status Register -------- */
#define FLEX_TWI_FSR_TXFEF_Pos                _U_(0)                                               /**< (FLEX_TWI_FSR) Transmit FIFO Empty Flag (cleared on read) Position */
#define FLEX_TWI_FSR_TXFEF_Msk                (_U_(0x1) << FLEX_TWI_FSR_TXFEF_Pos)                 /**< (FLEX_TWI_FSR) Transmit FIFO Empty Flag (cleared on read) Mask */
#define FLEX_TWI_FSR_TXFEF(value)             (FLEX_TWI_FSR_TXFEF_Msk & ((value) << FLEX_TWI_FSR_TXFEF_Pos))
#define FLEX_TWI_FSR_TXFFF_Pos                _U_(1)                                               /**< (FLEX_TWI_FSR) Transmit FIFO Full Flag (cleared on read) Position */
#define FLEX_TWI_FSR_TXFFF_Msk                (_U_(0x1) << FLEX_TWI_FSR_TXFFF_Pos)                 /**< (FLEX_TWI_FSR) Transmit FIFO Full Flag (cleared on read) Mask */
#define FLEX_TWI_FSR_TXFFF(value)             (FLEX_TWI_FSR_TXFFF_Msk & ((value) << FLEX_TWI_FSR_TXFFF_Pos))
#define FLEX_TWI_FSR_TXFTHF_Pos               _U_(2)                                               /**< (FLEX_TWI_FSR) Transmit FIFO Threshold Flag (cleared on read) Position */
#define FLEX_TWI_FSR_TXFTHF_Msk               (_U_(0x1) << FLEX_TWI_FSR_TXFTHF_Pos)                /**< (FLEX_TWI_FSR) Transmit FIFO Threshold Flag (cleared on read) Mask */
#define FLEX_TWI_FSR_TXFTHF(value)            (FLEX_TWI_FSR_TXFTHF_Msk & ((value) << FLEX_TWI_FSR_TXFTHF_Pos))
#define FLEX_TWI_FSR_RXFEF_Pos                _U_(3)                                               /**< (FLEX_TWI_FSR) Receive FIFO Empty Flag Position */
#define FLEX_TWI_FSR_RXFEF_Msk                (_U_(0x1) << FLEX_TWI_FSR_RXFEF_Pos)                 /**< (FLEX_TWI_FSR) Receive FIFO Empty Flag Mask */
#define FLEX_TWI_FSR_RXFEF(value)             (FLEX_TWI_FSR_RXFEF_Msk & ((value) << FLEX_TWI_FSR_RXFEF_Pos))
#define FLEX_TWI_FSR_RXFFF_Pos                _U_(4)                                               /**< (FLEX_TWI_FSR) Receive FIFO Full Flag Position */
#define FLEX_TWI_FSR_RXFFF_Msk                (_U_(0x1) << FLEX_TWI_FSR_RXFFF_Pos)                 /**< (FLEX_TWI_FSR) Receive FIFO Full Flag Mask */
#define FLEX_TWI_FSR_RXFFF(value)             (FLEX_TWI_FSR_RXFFF_Msk & ((value) << FLEX_TWI_FSR_RXFFF_Pos))
#define FLEX_TWI_FSR_RXFTHF_Pos               _U_(5)                                               /**< (FLEX_TWI_FSR) Receive FIFO Threshold Flag Position */
#define FLEX_TWI_FSR_RXFTHF_Msk               (_U_(0x1) << FLEX_TWI_FSR_RXFTHF_Pos)                /**< (FLEX_TWI_FSR) Receive FIFO Threshold Flag Mask */
#define FLEX_TWI_FSR_RXFTHF(value)            (FLEX_TWI_FSR_RXFTHF_Msk & ((value) << FLEX_TWI_FSR_RXFTHF_Pos))
#define FLEX_TWI_FSR_TXFPTEF_Pos              _U_(6)                                               /**< (FLEX_TWI_FSR) Transmit FIFO Pointer Error Flag Position */
#define FLEX_TWI_FSR_TXFPTEF_Msk              (_U_(0x1) << FLEX_TWI_FSR_TXFPTEF_Pos)               /**< (FLEX_TWI_FSR) Transmit FIFO Pointer Error Flag Mask */
#define FLEX_TWI_FSR_TXFPTEF(value)           (FLEX_TWI_FSR_TXFPTEF_Msk & ((value) << FLEX_TWI_FSR_TXFPTEF_Pos))
#define FLEX_TWI_FSR_RXFPTEF_Pos              _U_(7)                                               /**< (FLEX_TWI_FSR) Receive FIFO Pointer Error Flag Position */
#define FLEX_TWI_FSR_RXFPTEF_Msk              (_U_(0x1) << FLEX_TWI_FSR_RXFPTEF_Pos)               /**< (FLEX_TWI_FSR) Receive FIFO Pointer Error Flag Mask */
#define FLEX_TWI_FSR_RXFPTEF(value)           (FLEX_TWI_FSR_RXFPTEF_Msk & ((value) << FLEX_TWI_FSR_RXFPTEF_Pos))
#define FLEX_TWI_FSR_Msk                      _U_(0x000000FF)                                      /**< (FLEX_TWI_FSR) Register Mask  */


/* -------- FLEX_TWI_FIER : (FLEXCOM Offset: 0x664) ( /W 32) TWI FIFO Interrupt Enable Register -------- */
#define FLEX_TWI_FIER_TXFEF_Pos               _U_(0)                                               /**< (FLEX_TWI_FIER) TXFEF Interrupt Enable Position */
#define FLEX_TWI_FIER_TXFEF_Msk               (_U_(0x1) << FLEX_TWI_FIER_TXFEF_Pos)                /**< (FLEX_TWI_FIER) TXFEF Interrupt Enable Mask */
#define FLEX_TWI_FIER_TXFEF(value)            (FLEX_TWI_FIER_TXFEF_Msk & ((value) << FLEX_TWI_FIER_TXFEF_Pos))
#define FLEX_TWI_FIER_TXFFF_Pos               _U_(1)                                               /**< (FLEX_TWI_FIER) TXFFF Interrupt Enable Position */
#define FLEX_TWI_FIER_TXFFF_Msk               (_U_(0x1) << FLEX_TWI_FIER_TXFFF_Pos)                /**< (FLEX_TWI_FIER) TXFFF Interrupt Enable Mask */
#define FLEX_TWI_FIER_TXFFF(value)            (FLEX_TWI_FIER_TXFFF_Msk & ((value) << FLEX_TWI_FIER_TXFFF_Pos))
#define FLEX_TWI_FIER_TXFTHF_Pos              _U_(2)                                               /**< (FLEX_TWI_FIER) TXFTHF Interrupt Enable Position */
#define FLEX_TWI_FIER_TXFTHF_Msk              (_U_(0x1) << FLEX_TWI_FIER_TXFTHF_Pos)               /**< (FLEX_TWI_FIER) TXFTHF Interrupt Enable Mask */
#define FLEX_TWI_FIER_TXFTHF(value)           (FLEX_TWI_FIER_TXFTHF_Msk & ((value) << FLEX_TWI_FIER_TXFTHF_Pos))
#define FLEX_TWI_FIER_RXFEF_Pos               _U_(3)                                               /**< (FLEX_TWI_FIER) RXFEF Interrupt Enable Position */
#define FLEX_TWI_FIER_RXFEF_Msk               (_U_(0x1) << FLEX_TWI_FIER_RXFEF_Pos)                /**< (FLEX_TWI_FIER) RXFEF Interrupt Enable Mask */
#define FLEX_TWI_FIER_RXFEF(value)            (FLEX_TWI_FIER_RXFEF_Msk & ((value) << FLEX_TWI_FIER_RXFEF_Pos))
#define FLEX_TWI_FIER_RXFFF_Pos               _U_(4)                                               /**< (FLEX_TWI_FIER) RXFFF Interrupt Enable Position */
#define FLEX_TWI_FIER_RXFFF_Msk               (_U_(0x1) << FLEX_TWI_FIER_RXFFF_Pos)                /**< (FLEX_TWI_FIER) RXFFF Interrupt Enable Mask */
#define FLEX_TWI_FIER_RXFFF(value)            (FLEX_TWI_FIER_RXFFF_Msk & ((value) << FLEX_TWI_FIER_RXFFF_Pos))
#define FLEX_TWI_FIER_RXFTHF_Pos              _U_(5)                                               /**< (FLEX_TWI_FIER) RXFTHF Interrupt Enable Position */
#define FLEX_TWI_FIER_RXFTHF_Msk              (_U_(0x1) << FLEX_TWI_FIER_RXFTHF_Pos)               /**< (FLEX_TWI_FIER) RXFTHF Interrupt Enable Mask */
#define FLEX_TWI_FIER_RXFTHF(value)           (FLEX_TWI_FIER_RXFTHF_Msk & ((value) << FLEX_TWI_FIER_RXFTHF_Pos))
#define FLEX_TWI_FIER_TXFPTEF_Pos             _U_(6)                                               /**< (FLEX_TWI_FIER) TXFPTEF Interrupt Enable Position */
#define FLEX_TWI_FIER_TXFPTEF_Msk             (_U_(0x1) << FLEX_TWI_FIER_TXFPTEF_Pos)              /**< (FLEX_TWI_FIER) TXFPTEF Interrupt Enable Mask */
#define FLEX_TWI_FIER_TXFPTEF(value)          (FLEX_TWI_FIER_TXFPTEF_Msk & ((value) << FLEX_TWI_FIER_TXFPTEF_Pos))
#define FLEX_TWI_FIER_RXFPTEF_Pos             _U_(7)                                               /**< (FLEX_TWI_FIER) RXFPTEF Interrupt Enable Position */
#define FLEX_TWI_FIER_RXFPTEF_Msk             (_U_(0x1) << FLEX_TWI_FIER_RXFPTEF_Pos)              /**< (FLEX_TWI_FIER) RXFPTEF Interrupt Enable Mask */
#define FLEX_TWI_FIER_RXFPTEF(value)          (FLEX_TWI_FIER_RXFPTEF_Msk & ((value) << FLEX_TWI_FIER_RXFPTEF_Pos))
#define FLEX_TWI_FIER_Msk                     _U_(0x000000FF)                                      /**< (FLEX_TWI_FIER) Register Mask  */


/* -------- FLEX_TWI_FIDR : (FLEXCOM Offset: 0x668) ( /W 32) TWI FIFO Interrupt Disable Register -------- */
#define FLEX_TWI_FIDR_TXFEF_Pos               _U_(0)                                               /**< (FLEX_TWI_FIDR) TXFEF Interrupt Disable Position */
#define FLEX_TWI_FIDR_TXFEF_Msk               (_U_(0x1) << FLEX_TWI_FIDR_TXFEF_Pos)                /**< (FLEX_TWI_FIDR) TXFEF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_TXFEF(value)            (FLEX_TWI_FIDR_TXFEF_Msk & ((value) << FLEX_TWI_FIDR_TXFEF_Pos))
#define FLEX_TWI_FIDR_TXFFF_Pos               _U_(1)                                               /**< (FLEX_TWI_FIDR) TXFFF Interrupt Disable Position */
#define FLEX_TWI_FIDR_TXFFF_Msk               (_U_(0x1) << FLEX_TWI_FIDR_TXFFF_Pos)                /**< (FLEX_TWI_FIDR) TXFFF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_TXFFF(value)            (FLEX_TWI_FIDR_TXFFF_Msk & ((value) << FLEX_TWI_FIDR_TXFFF_Pos))
#define FLEX_TWI_FIDR_TXFTHF_Pos              _U_(2)                                               /**< (FLEX_TWI_FIDR) TXFTHF Interrupt Disable Position */
#define FLEX_TWI_FIDR_TXFTHF_Msk              (_U_(0x1) << FLEX_TWI_FIDR_TXFTHF_Pos)               /**< (FLEX_TWI_FIDR) TXFTHF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_TXFTHF(value)           (FLEX_TWI_FIDR_TXFTHF_Msk & ((value) << FLEX_TWI_FIDR_TXFTHF_Pos))
#define FLEX_TWI_FIDR_RXFEF_Pos               _U_(3)                                               /**< (FLEX_TWI_FIDR) RXFEF Interrupt Disable Position */
#define FLEX_TWI_FIDR_RXFEF_Msk               (_U_(0x1) << FLEX_TWI_FIDR_RXFEF_Pos)                /**< (FLEX_TWI_FIDR) RXFEF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_RXFEF(value)            (FLEX_TWI_FIDR_RXFEF_Msk & ((value) << FLEX_TWI_FIDR_RXFEF_Pos))
#define FLEX_TWI_FIDR_RXFFF_Pos               _U_(4)                                               /**< (FLEX_TWI_FIDR) RXFFF Interrupt Disable Position */
#define FLEX_TWI_FIDR_RXFFF_Msk               (_U_(0x1) << FLEX_TWI_FIDR_RXFFF_Pos)                /**< (FLEX_TWI_FIDR) RXFFF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_RXFFF(value)            (FLEX_TWI_FIDR_RXFFF_Msk & ((value) << FLEX_TWI_FIDR_RXFFF_Pos))
#define FLEX_TWI_FIDR_RXFTHF_Pos              _U_(5)                                               /**< (FLEX_TWI_FIDR) RXFTHF Interrupt Disable Position */
#define FLEX_TWI_FIDR_RXFTHF_Msk              (_U_(0x1) << FLEX_TWI_FIDR_RXFTHF_Pos)               /**< (FLEX_TWI_FIDR) RXFTHF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_RXFTHF(value)           (FLEX_TWI_FIDR_RXFTHF_Msk & ((value) << FLEX_TWI_FIDR_RXFTHF_Pos))
#define FLEX_TWI_FIDR_TXFPTEF_Pos             _U_(6)                                               /**< (FLEX_TWI_FIDR) TXFPTEF Interrupt Disable Position */
#define FLEX_TWI_FIDR_TXFPTEF_Msk             (_U_(0x1) << FLEX_TWI_FIDR_TXFPTEF_Pos)              /**< (FLEX_TWI_FIDR) TXFPTEF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_TXFPTEF(value)          (FLEX_TWI_FIDR_TXFPTEF_Msk & ((value) << FLEX_TWI_FIDR_TXFPTEF_Pos))
#define FLEX_TWI_FIDR_RXFPTEF_Pos             _U_(7)                                               /**< (FLEX_TWI_FIDR) RXFPTEF Interrupt Disable Position */
#define FLEX_TWI_FIDR_RXFPTEF_Msk             (_U_(0x1) << FLEX_TWI_FIDR_RXFPTEF_Pos)              /**< (FLEX_TWI_FIDR) RXFPTEF Interrupt Disable Mask */
#define FLEX_TWI_FIDR_RXFPTEF(value)          (FLEX_TWI_FIDR_RXFPTEF_Msk & ((value) << FLEX_TWI_FIDR_RXFPTEF_Pos))
#define FLEX_TWI_FIDR_Msk                     _U_(0x000000FF)                                      /**< (FLEX_TWI_FIDR) Register Mask  */


/* -------- FLEX_TWI_FIMR : (FLEXCOM Offset: 0x66C) ( R/ 32) TWI FIFO Interrupt Mask Register -------- */
#define FLEX_TWI_FIMR_TXFEF_Pos               _U_(0)                                               /**< (FLEX_TWI_FIMR) TXFEF Interrupt Mask Position */
#define FLEX_TWI_FIMR_TXFEF_Msk               (_U_(0x1) << FLEX_TWI_FIMR_TXFEF_Pos)                /**< (FLEX_TWI_FIMR) TXFEF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_TXFEF(value)            (FLEX_TWI_FIMR_TXFEF_Msk & ((value) << FLEX_TWI_FIMR_TXFEF_Pos))
#define FLEX_TWI_FIMR_TXFFF_Pos               _U_(1)                                               /**< (FLEX_TWI_FIMR) TXFFF Interrupt Mask Position */
#define FLEX_TWI_FIMR_TXFFF_Msk               (_U_(0x1) << FLEX_TWI_FIMR_TXFFF_Pos)                /**< (FLEX_TWI_FIMR) TXFFF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_TXFFF(value)            (FLEX_TWI_FIMR_TXFFF_Msk & ((value) << FLEX_TWI_FIMR_TXFFF_Pos))
#define FLEX_TWI_FIMR_TXFTHF_Pos              _U_(2)                                               /**< (FLEX_TWI_FIMR) TXFTHF Interrupt Mask Position */
#define FLEX_TWI_FIMR_TXFTHF_Msk              (_U_(0x1) << FLEX_TWI_FIMR_TXFTHF_Pos)               /**< (FLEX_TWI_FIMR) TXFTHF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_TXFTHF(value)           (FLEX_TWI_FIMR_TXFTHF_Msk & ((value) << FLEX_TWI_FIMR_TXFTHF_Pos))
#define FLEX_TWI_FIMR_RXFEF_Pos               _U_(3)                                               /**< (FLEX_TWI_FIMR) RXFEF Interrupt Mask Position */
#define FLEX_TWI_FIMR_RXFEF_Msk               (_U_(0x1) << FLEX_TWI_FIMR_RXFEF_Pos)                /**< (FLEX_TWI_FIMR) RXFEF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_RXFEF(value)            (FLEX_TWI_FIMR_RXFEF_Msk & ((value) << FLEX_TWI_FIMR_RXFEF_Pos))
#define FLEX_TWI_FIMR_RXFFF_Pos               _U_(4)                                               /**< (FLEX_TWI_FIMR) RXFFF Interrupt Mask Position */
#define FLEX_TWI_FIMR_RXFFF_Msk               (_U_(0x1) << FLEX_TWI_FIMR_RXFFF_Pos)                /**< (FLEX_TWI_FIMR) RXFFF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_RXFFF(value)            (FLEX_TWI_FIMR_RXFFF_Msk & ((value) << FLEX_TWI_FIMR_RXFFF_Pos))
#define FLEX_TWI_FIMR_RXFTHF_Pos              _U_(5)                                               /**< (FLEX_TWI_FIMR) RXFTHF Interrupt Mask Position */
#define FLEX_TWI_FIMR_RXFTHF_Msk              (_U_(0x1) << FLEX_TWI_FIMR_RXFTHF_Pos)               /**< (FLEX_TWI_FIMR) RXFTHF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_RXFTHF(value)           (FLEX_TWI_FIMR_RXFTHF_Msk & ((value) << FLEX_TWI_FIMR_RXFTHF_Pos))
#define FLEX_TWI_FIMR_TXFPTEF_Pos             _U_(6)                                               /**< (FLEX_TWI_FIMR) TXFPTEF Interrupt Mask Position */
#define FLEX_TWI_FIMR_TXFPTEF_Msk             (_U_(0x1) << FLEX_TWI_FIMR_TXFPTEF_Pos)              /**< (FLEX_TWI_FIMR) TXFPTEF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_TXFPTEF(value)          (FLEX_TWI_FIMR_TXFPTEF_Msk & ((value) << FLEX_TWI_FIMR_TXFPTEF_Pos))
#define FLEX_TWI_FIMR_RXFPTEF_Pos             _U_(7)                                               /**< (FLEX_TWI_FIMR) RXFPTEF Interrupt Mask Position */
#define FLEX_TWI_FIMR_RXFPTEF_Msk             (_U_(0x1) << FLEX_TWI_FIMR_RXFPTEF_Pos)              /**< (FLEX_TWI_FIMR) RXFPTEF Interrupt Mask Mask */
#define FLEX_TWI_FIMR_RXFPTEF(value)          (FLEX_TWI_FIMR_RXFPTEF_Msk & ((value) << FLEX_TWI_FIMR_RXFPTEF_Pos))
#define FLEX_TWI_FIMR_Msk                     _U_(0x000000FF)                                      /**< (FLEX_TWI_FIMR) Register Mask  */


/* -------- FLEX_TWI_DR : (FLEXCOM Offset: 0x6D0) ( R/ 32) TWI Debug Register -------- */
#define FLEX_TWI_DR_SWEN_Pos                  _U_(0)                                               /**< (FLEX_TWI_DR) SleepWalking Enable Position */
#define FLEX_TWI_DR_SWEN_Msk                  (_U_(0x1) << FLEX_TWI_DR_SWEN_Pos)                   /**< (FLEX_TWI_DR) SleepWalking Enable Mask */
#define FLEX_TWI_DR_SWEN(value)               (FLEX_TWI_DR_SWEN_Msk & ((value) << FLEX_TWI_DR_SWEN_Pos))
#define FLEX_TWI_DR_CLKRQ_Pos                 _U_(1)                                               /**< (FLEX_TWI_DR) Clock Request Position */
#define FLEX_TWI_DR_CLKRQ_Msk                 (_U_(0x1) << FLEX_TWI_DR_CLKRQ_Pos)                  /**< (FLEX_TWI_DR) Clock Request Mask */
#define FLEX_TWI_DR_CLKRQ(value)              (FLEX_TWI_DR_CLKRQ_Msk & ((value) << FLEX_TWI_DR_CLKRQ_Pos))
#define FLEX_TWI_DR_SWMATCH_Pos               _U_(2)                                               /**< (FLEX_TWI_DR) SleepWalking Match Position */
#define FLEX_TWI_DR_SWMATCH_Msk               (_U_(0x1) << FLEX_TWI_DR_SWMATCH_Pos)                /**< (FLEX_TWI_DR) SleepWalking Match Mask */
#define FLEX_TWI_DR_SWMATCH(value)            (FLEX_TWI_DR_SWMATCH_Msk & ((value) << FLEX_TWI_DR_SWMATCH_Pos))
#define FLEX_TWI_DR_TRP_Pos                   _U_(3)                                               /**< (FLEX_TWI_DR) Transfer Pending Position */
#define FLEX_TWI_DR_TRP_Msk                   (_U_(0x1) << FLEX_TWI_DR_TRP_Pos)                    /**< (FLEX_TWI_DR) Transfer Pending Mask */
#define FLEX_TWI_DR_TRP(value)                (FLEX_TWI_DR_TRP_Msk & ((value) << FLEX_TWI_DR_TRP_Pos))
#define FLEX_TWI_DR_Msk                       _U_(0x0000000F)                                      /**< (FLEX_TWI_DR) Register Mask  */


/* -------- FLEX_TWI_WPMR : (FLEXCOM Offset: 0x6E4) (R/W 32) TWI Write Protection Mode Register -------- */
#define FLEX_TWI_WPMR_WPEN_Pos                _U_(0)                                               /**< (FLEX_TWI_WPMR) Write Protection Enable Position */
#define FLEX_TWI_WPMR_WPEN_Msk                (_U_(0x1) << FLEX_TWI_WPMR_WPEN_Pos)                 /**< (FLEX_TWI_WPMR) Write Protection Enable Mask */
#define FLEX_TWI_WPMR_WPEN(value)             (FLEX_TWI_WPMR_WPEN_Msk & ((value) << FLEX_TWI_WPMR_WPEN_Pos))
#define FLEX_TWI_WPMR_WPKEY_Pos               _U_(8)                                               /**< (FLEX_TWI_WPMR) Write Protection Key Position */
#define FLEX_TWI_WPMR_WPKEY_Msk               (_U_(0xFFFFFF) << FLEX_TWI_WPMR_WPKEY_Pos)           /**< (FLEX_TWI_WPMR) Write Protection Key Mask */
#define FLEX_TWI_WPMR_WPKEY(value)            (FLEX_TWI_WPMR_WPKEY_Msk & ((value) << FLEX_TWI_WPMR_WPKEY_Pos))
#define   FLEX_TWI_WPMR_WPKEY_PASSWD_Val      _U_(0x545749)                                        /**< (FLEX_TWI_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0  */
#define FLEX_TWI_WPMR_WPKEY_PASSWD            (FLEX_TWI_WPMR_WPKEY_PASSWD_Val << FLEX_TWI_WPMR_WPKEY_Pos) /**< (FLEX_TWI_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0 Position  */
#define FLEX_TWI_WPMR_Msk                     _U_(0xFFFFFF01)                                      /**< (FLEX_TWI_WPMR) Register Mask  */


